notes/20230914021014-algorithmic_trading.md

# Table of Contents

1.  [Hypothesis](#orgb52b6e0)
2.  [General Strategy](#orgfc9cc09)
3.  [Goal](#org9de8127)
    1.  [money](#org32867a1)
    2.  [study](#org7af6b4a)
4.  [Workflow (essential qualities to have)](#orge67d2ef)
    1.  [hypothesis - predict - see outcome - evaluate loop](#org7a47e19)
    2.  [which data to use](#orge3122fe)
        1.  [at what level, data is available in time](#org37abb89)
        2.  [integrate human judgement with rule prediction](#orgc0abf10)
    3.  [spell out the decision step](#org33b0c00)
    4.  [record decisions, I might need to review them](#org50b356b)
    5.  [decision rule, or thinking might be good only in certain situations](#orga874266)
5.  [Study plan](#org38f6862)
6.  [algorithm integration principles](#org5168e74)
7.  [Decisions as of now](#org3860314)



<a id="orgb52b6e0"></a>

# Hypothesis

I&rsquo;m not sure this will work.

this might work, because

-   market might be efficient
-   but people are not rational


<a id="orgfc9cc09"></a>

# General Strategy

need not perfect information nor perfect algorithm

I&rsquo;ll perform the trading manually and see if I can automate some of my work.


<a id="org9de8127"></a>

# Goal


<a id="org32867a1"></a>

## money

beat the stock market by a noticable magine

-   when stock market yields 5% return, I want to achieve 5.5% return (10% relatively)


<a id="org7af6b4a"></a>

## study

ai, finance, decision making


<a id="orge67d2ef"></a>

# Workflow (essential qualities to have)


<a id="org7a47e19"></a>

## hypothesis - predict - see outcome - evaluate loop


<a id="orge3122fe"></a>

## which data to use


<a id="org37abb89"></a>

### at what level, data is available in time

-   company / sector / country / world


<a id="orgc0abf10"></a>

### integrate human judgement with rule prediction

-   probably more efficient to use human judgement


<a id="org33b0c00"></a>

## spell out the decision step

Describe how a decision is made on what basis.

There are many hypothesis / assumptions i&rsquo;m making when making a decision.
I might not be able to spell out all, but when somethings work or not work, I need to look at the assumptions that I made to evaluate and increment

-   emotions
    probably the most powerful factor that governs my decisions but overlooked by myself.
-   hypothesis
-   prediction rule


<a id="org50b356b"></a>

## record decisions, I might need to review them


<a id="orga874266"></a>

## decision rule, or thinking might be good only in certain situations

For instance, when a stock price rise, it could indicate the company is doing good, or it could mean the stock is getting riskier.
When I make a rule, I assume situations that the rule might be applied favorably
Problem is that I can not see what I don&rsquo;t see.

-   test result shows that the decision rule worked or not under the specific situation which I don&rsquo;t fully understand


<a id="org38f6862"></a>

# Study plan

[Study curriculum](file:///Users/littlehome/Dropbox/notes/agendas/investing.md)


<a id="org5168e74"></a>

# algorithm integration principles

Don&rsquo;t know how much it will work.
Don&rsquo;t lose focus on big picture, algorithm is just for aid.
Be aware that putting energy into it because it captures some idea without clearly specifying the assumptions would result in a wasted time.

On the other hand, when we decide to implement algorithm, desired properties are

[algorithm develop principles](20230918120505-algorithm_develop_principles.md)


<a id="org3860314"></a>

# Decisions as of now

Update decisions as I learn

[decisions](20230922172026-decisions.md)

